# SetHookRotationAngle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..SetHookRotationAngle Method
Rebar Class See Also
---
Sets the out of plane hook rotation angle at the specified end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public void SetHookRotationAngle(
	double hookRotationAngle,
	int iEnd
)
```

Visual Basic
---
```text
Public Sub SetHookRotationAngle ( _
	hookRotationAngle As Double, _
	iEnd As Integer _
)
```

Visual C++
---
```text
public:
void SetHookRotationAngle(
	double hookRotationAngle,
	int iEnd
)
```

# ### Parameters
hookRotationAngle
    Type: System..::..Double The out of plane hook rotation angle at the specified end.
iEnd
    Type: System..::..Int32 0 for the start , 1 for the end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | iEnd must be 0 or 1. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace